remalhq/Remal_ArduinoBoards/arch/esp32/1.2.5/boards.txt
#################################################################
#	Modified by Khalid AlAwadhi - Remal IoT, 2024		
# 	> Changes focused on removing anything not related to the
#	  ESP32C3 as Shabakah is powered by the ESP32C3
# 	> Changes also focused on renaming UI to show Shabakah (Founders Edition)
#
#	Original files by Espressif systems found here:			
#	> https://raw.githubusercontent.com/espressif/arduino-esp32/gh-pages/package_esp32_index.json
#################################################################

# Official Espressif options
menu.UploadSpeed=Upload Speed
menu.USBMode=USB Mode
menu.CDCOnBoot=USB CDC On Boot
menu.MSCOnBoot=USB Firmware MSC On Boot
menu.DFUOnBoot=USB DFU On Boot
menu.UploadMode=Upload Mode
menu.CPUFreq=CPU Frequency
menu.FlashFreq=Flash Frequency
menu.FlashMode=Flash Mode
menu.FlashSize=Flash Size
menu.PartitionScheme=Partition Scheme
menu.DebugLevel=Core Debug Level
menu.PSRAM=PSRAM
menu.LoopCore=Arduino Runs On
menu.EventsCore=Events Run On
menu.MemoryType=Memory Type
menu.EraseFlash=Erase All Flash Before Sketch Upload
menu.JTAGAdapter=JTAG Adapter
menu.PinNumbers=Pin Numbering


##############################################################
### Boards:												   ###
##############################################################

##changed vvv:
remalshabakahfe.name=Shabakah (Founders Edition)
remalshabakahfe.vid.0=0x303A
remalshabakahfe.pid.0=0x1001

remalshabakahfe.bootloader.tool=esptool_py
remalshabakahfe.bootloader.tool.default=esptool_py

remalshabakahfe.upload.tool=esptool_py
remalshabakahfe.upload.tool.default=esptool_py
remalshabakahfe.upload.tool.network=esp_ota

remalshabakahfe.upload.maximum_size=1310720
remalshabakahfe.upload.maximum_data_size=327680
remalshabakahfe.upload.flags=
remalshabakahfe.upload.extra_flags=
remalshabakahfe.upload.use_1200bps_touch=false
remalshabakahfe.upload.wait_for_upload_port=false

remalshabakahfe.serial.disableDTR=false
remalshabakahfe.serial.disableRTS=false

remalshabakahfe.build.tarch=riscv32
remalshabakahfe.build.target=esp
remalshabakahfe.build.mcu=esp32c3
remalshabakahfe.build.core=esp32
##changed vvv:
remalshabakahfe.build.variant=shabakah_fe
##changed vvv:
remalshabakahfe.build.board=SHABAKAH_FE
remalshabakahfe.build.bootloader_addr=0x0

remalshabakahfe.build.cdc_on_boot=0
remalshabakahfe.build.f_cpu=160000000L
remalshabakahfe.build.flash_size=4MB
remalshabakahfe.build.flash_freq=80m
#changed vvv:
remalshabakahfe.build.flash_mode=dio
#changed vvv:
remalshabakahfe.build.boot=dio
remalshabakahfe.build.partitions=default
remalshabakahfe.build.defines=

## IDE 2.0 Seems to not update the value
remalshabakahfe.menu.JTAGAdapter.default=Disabled
remalshabakahfe.menu.JTAGAdapter.default.build.copy_jtag_files=0
remalshabakahfe.menu.JTAGAdapter.builtin=Integrated USB JTAG
remalshabakahfe.menu.JTAGAdapter.builtin.build.openocdscript=esp32c3-builtin.cfg
remalshabakahfe.menu.JTAGAdapter.builtin.build.copy_jtag_files=1
remalshabakahfe.menu.JTAGAdapter.external=FTDI Adapter
remalshabakahfe.menu.JTAGAdapter.external.build.openocdscript=esp32c3-ftdi.cfg
remalshabakahfe.menu.JTAGAdapter.external.build.copy_jtag_files=1
remalshabakahfe.menu.JTAGAdapter.bridge=ESP USB Bridge
remalshabakahfe.menu.JTAGAdapter.bridge.build.openocdscript=esp32c3-bridge.cfg
remalshabakahfe.menu.JTAGAdapter.bridge.build.copy_jtag_files=1

## Remal IoT - Updated to Enabled as default to allow using USB with Arduino Serial calls
remalshabakahfe.menu.CDCOnBoot.default=Enabled
remalshabakahfe.menu.CDCOnBoot.default.build.cdc_on_boot=1
remalshabakahfe.menu.CDCOnBoot.cdc=Disabled
remalshabakahfe.menu.CDCOnBoot.cdc.build.cdc_on_boot=0

## Remal IoT - Made default to be Huge APP (3MB No OTA/1MB SPIFFS)
#remalshabakahfe.menu.PartitionScheme.default=Huge APP (3MB No OTA/1MB SPIFFS)
#remalshabakahfe.menu.PartitionScheme.default.build.partitions=huge_app
#remalshabakahfe.menu.PartitionScheme.default.upload.maximum_size=3145728

remalshabakahfe.menu.PartitionScheme.default=Default 4MB with spiffs (1.2MB APP/1.5MB SPIFFS)
remalshabakahfe.menu.PartitionScheme.default.build.partitions=default

remalshabakahfe.menu.PartitionScheme.defaultffat=Default 4MB with ffat (1.2MB APP/1.5MB FATFS)
remalshabakahfe.menu.PartitionScheme.defaultffat.build.partitions=default_ffat

remalshabakahfe.menu.PartitionScheme.minimal=Minimal (1.3MB APP/700KB SPIFFS)
remalshabakahfe.menu.PartitionScheme.minimal.build.partitions=minimal

remalshabakahfe.menu.PartitionScheme.no_ota=No OTA (2MB APP/2MB SPIFFS)
remalshabakahfe.menu.PartitionScheme.no_ota.build.partitions=no_ota
remalshabakahfe.menu.PartitionScheme.no_ota.upload.maximum_size=2097152

remalshabakahfe.menu.PartitionScheme.noota_3g=No OTA (1MB APP/3MB SPIFFS)
remalshabakahfe.menu.PartitionScheme.noota_3g.build.partitions=noota_3g
remalshabakahfe.menu.PartitionScheme.noota_3g.upload.maximum_size=1048576

remalshabakahfe.menu.PartitionScheme.noota_ffat=No OTA (2MB APP/2MB FATFS)
remalshabakahfe.menu.PartitionScheme.noota_ffat.build.partitions=noota_ffat
remalshabakahfe.menu.PartitionScheme.noota_ffat.upload.maximum_size=2097152

remalshabakahfe.menu.PartitionScheme.noota_3gffat=No OTA (1MB APP/3MB FATFS)
remalshabakahfe.menu.PartitionScheme.noota_3gffat.build.partitions=noota_3gffat
remalshabakahfe.menu.PartitionScheme.noota_3gffat.upload.maximum_size=1048576

#remalshabakahfe.menu.PartitionScheme.huge_app=Huge APP (3MB No OTA/1MB SPIFFS)
#remalshabakahfe.menu.PartitionScheme.huge_app.build.partitions=huge_app
#remalshabakahfe.menu.PartitionScheme.huge_app.upload.maximum_size=3145728

remalshabakahfe.menu.PartitionScheme.min_spiffs=Minimal SPIFFS (1.9MB APP with OTA/190KB SPIFFS)
remalshabakahfe.menu.PartitionScheme.min_spiffs.build.partitions=min_spiffs
remalshabakahfe.menu.PartitionScheme.min_spiffs.upload.maximum_size=1966080

remalshabakahfe.menu.CPUFreq.160=160MHz (WiFi)
remalshabakahfe.menu.CPUFreq.160.build.f_cpu=160000000L
remalshabakahfe.menu.CPUFreq.80=80MHz (WiFi)
remalshabakahfe.menu.CPUFreq.80.build.f_cpu=80000000L
remalshabakahfe.menu.CPUFreq.40=40MHz
remalshabakahfe.menu.CPUFreq.40.build.f_cpu=40000000L
remalshabakahfe.menu.CPUFreq.20=20MHz
remalshabakahfe.menu.CPUFreq.20.build.f_cpu=20000000L
remalshabakahfe.menu.CPUFreq.10=10MHz
remalshabakahfe.menu.CPUFreq.10.build.f_cpu=10000000L

## Remal IoT - Disabled unused options
#remalshabakahfe.menu.FlashMode.qio=QIO
#remalshabakahfe.menu.FlashMode.qio.build.flash_mode=dio
#remalshabakahfe.menu.FlashMode.qio.build.boot=qio
remalshabakahfe.menu.FlashMode.dio=DIO
remalshabakahfe.menu.FlashMode.dio.build.flash_mode=dio
remalshabakahfe.menu.FlashMode.dio.build.boot=dio
#remalshabakahfe.menu.FlashMode.qout=QOUT
#remalshabakahfe.menu.FlashMode.qout.build.flash_mode=dout
#remalshabakahfe.menu.FlashMode.qout.build.boot=qout
#remalshabakahfe.menu.FlashMode.dout=DOUT
#remalshabakahfe.menu.FlashMode.dout.build.flash_mode=dout
#remalshabakahfe.menu.FlashMode.dout.build.boot=dout

remalshabakahfe.menu.FlashFreq.80=80MHz
remalshabakahfe.menu.FlashFreq.80.build.flash_freq=80m
remalshabakahfe.menu.FlashFreq.40=40MHz
remalshabakahfe.menu.FlashFreq.40.build.flash_freq=40m

remalshabakahfe.menu.FlashSize.4M=4MB (32Mb)
remalshabakahfe.menu.FlashSize.4M.build.flash_size=4MB

remalshabakahfe.menu.UploadSpeed.921600.upload.speed=921600
remalshabakahfe.menu.UploadSpeed.115200=115200
remalshabakahfe.menu.UploadSpeed.115200.upload.speed=115200
remalshabakahfe.menu.UploadSpeed.256000.windows=256000
remalshabakahfe.menu.UploadSpeed.256000.upload.speed=256000
remalshabakahfe.menu.UploadSpeed.230400.windows.upload.speed=256000
remalshabakahfe.menu.UploadSpeed.230400=230400
remalshabakahfe.menu.UploadSpeed.230400.upload.speed=230400
remalshabakahfe.menu.UploadSpeed.460800.linux=460800
remalshabakahfe.menu.UploadSpeed.460800.macosx=460800
remalshabakahfe.menu.UploadSpeed.460800.upload.speed=460800
remalshabakahfe.menu.UploadSpeed.512000.windows=512000
remalshabakahfe.menu.UploadSpeed.512000.upload.speed=512000

remalshabakahfe.menu.DebugLevel.none=None
remalshabakahfe.menu.DebugLevel.none.build.code_debug=0
remalshabakahfe.menu.DebugLevel.error=Error
remalshabakahfe.menu.DebugLevel.error.build.code_debug=1
remalshabakahfe.menu.DebugLevel.warn=Warn
remalshabakahfe.menu.DebugLevel.warn.build.code_debug=2
remalshabakahfe.menu.DebugLevel.info=Info
remalshabakahfe.menu.DebugLevel.info.build.code_debug=3
remalshabakahfe.menu.DebugLevel.debug=Debug
remalshabakahfe.menu.DebugLevel.debug.build.code_debug=4
remalshabakahfe.menu.DebugLevel.verbose=Verbose
remalshabakahfe.menu.DebugLevel.verbose.build.code_debug=5

remalshabakahfe.menu.EraseFlash.none=Disabled
remalshabakahfe.menu.EraseFlash.none.upload.erase_cmd=
remalshabakahfe.menu.EraseFlash.all=Enabled
remalshabakahfe.menu.EraseFlash.all.upload.erase_cmd=-e

##############################################################
